You’ve discovered that pandas is a Python library that facilitates reviewing and manipulating tabular data. In addition, groupby() and agg() are essential DataFrame methods that data professionals use to group, aggregate, summarize, and better understand data. In this reading, you’ll review how these functions work, as well as when and how to apply them.

In [ ]:
Aggregation: Computing summary statistics for each group

Transformation: Applying functions to each group and returning modified data

Filtration: Selecting specific groups based on certain conditions

Iteration: Iterating over groups or values

In [7]:
import numpy as np
import pandas as pd

In [8]:

clothes = pd.DataFrame({'type': ['pants', 'shirt', 'shirt', 'pants', 'shirt', 'pants'],
                       'color': ['red', 'blue', 'green', 'blue', 'green', 'red'],
                       'price_usd': [20, 35, 50, 40, 100, 75],
                       'mass_g': [125, 440, 680, 200, 395, 485]})


clothes

    type  color  price_usd  mass_g
0  pants    red         20     125
1  shirt   blue         35     440
2  shirt  green         50     680
3  pants   blue         40     200
4  shirt  green        100     395
5  pants    red         75     485

In [9]:
grouped = clothes.groupby('type')
print(grouped)
print(type(grouped))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002A055388410>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [12]:
grouped.mean(c) # careful, this doesn't work without the true

       price_usd  mass_g
type
pants  45.000000   270.0
shirt  61.666667   505.0

In [15]:
clothes.groupby(['type','color']).min()

             price_usd  mass_g
type  color
pants blue          40     200
      red           20     125
shirt blue          35     440
      green         50     395

To simply return the number of observations there are in each group, use the size() method. This will result in a Series object with the relevant information:

In [16]:
clothes.groupby(['type','color']).size()

type   color
pants  blue     1
       red      2
shirt  blue     1
       green    2
dtype: int64

count(): The number of non-null values in each group

sum(): The sum of values in each group

mean(): The mean of values in each group

median(): The median of values in each group

min(): The minimum value in each group

max(): The maximum value in each group

std(): The standard deviation of values in each group

var(): The variance of values in each group

agg()
The 
agg()
 function is useful when you want to apply multiple functions to a dataframe at the same time. agg() is a method that belongs to the DataFrame class. It stands for “aggregate.” Its most important parameters are:  

func: The function to be applied

axis: The axis over which to apply the function (default= 0).

In [17]:
clothes

    type  color  price_usd  mass_g
0  pants    red         20     125
1  shirt   blue         35     440
2  shirt  green         50     680
3  pants   blue         40     200
4  shirt  green        100     395
5  pants    red         75     485

In [18]:
clothes[['price_usd', 'mass_g']].agg(['sum', 'mean'])

       price_usd  mass_g
sum   320.000000  2325.0
mean   53.333333   387.5

In [19]:
clothes.agg({'price_usd': 'sum', 'mass_g': ['mean','median']})
# Again, each built-in function is entered as a string without parentheses.

        price_usd  mass_g
sum         320.0     NaN
mean          NaN   387.5
median        NaN   417.5

The following example applies the sum() and mean() functions across axis 1. In other words, instead of applying the functions down each column, they’re applied over each row.

In [20]:
clothes[['price_usd','mass_g']].agg(['sum','mean'], axis=1)

     sum   mean
0  145.0   72.5
1  475.0  237.5
2  730.0  365.0
3  240.0  120.0
4  495.0  247.5
5  560.0  280.0

In [21]:
# Group by and Aggregate together
clothes.groupby('color').agg({'price_usd': ['mean','max'],'mass_g':['mean','max']})

      price_usd      mass_g
           mean  max   mean  max
color
blue       37.5   40  320.0  440
green      75.0  100  537.5  680
red        47.5   75  305.0  485

In [22]:
grouped = clothes.groupby(['color', 'type']).agg(['mean', 'min'])
grouped

            price_usd     mass_g
                 mean min   mean  min
color type
blue  pants      40.0  40  200.0  200
      shirt      35.0  35  440.0  440
green shirt      75.0  50  537.5  395
red   pants      47.5  20  305.0  125

In [23]:
grouped.index

MultiIndex([( 'blue', 'pants'),
            ( 'blue', 'shirt'),
            ('green', 'shirt'),
            (  'red', 'pants')],
           names=['color', 'type'])

In [24]:
grouped.columns

MultiIndex([('price_usd', 'mean'),
            ('price_usd',  'min'),
            (   'mass_g', 'mean'),
            (   'mass_g',  'min')],
           )

In [25]:
grouped

            price_usd     mass_g
                 mean min   mean  min
color type
blue  pants      40.0  40  200.0  200
      shirt      35.0  35  440.0  440
green shirt      75.0  50  537.5  395
red   pants      47.5  20  305.0  125

In [26]:
grouped.loc[:, 'price_usd']

             mean  min
color type
blue  pants  40.0   40
      shirt  35.0   35
green shirt  75.0   50
red   pants  47.5   20

In [27]:
grouped.loc[:, ('price_usd', 'min')]

color  type
blue   pants    40
       shirt    35
green  shirt    50
red    pants    20
Name: (price_usd, min), dtype: int64

In [28]:
#To select first-level (left-most) row:
grouped.loc['blue', :]

      price_usd     mass_g
           mean min   mean  min
type
pants      40.0  40  200.0  200
shirt      35.0  35  440.0  440

In [29]:
#To select a bottom-level (right-most) row:
grouped.loc[('green', 'shirt'), :]

price_usd  mean     75.0
           min      50.0
mass_g     mean    537.5
           min     395.0
Name: (green, shirt), dtype: float64

In [33]:
#Even select individual values
grouped.loc[('blue', 'shirt'), ('mass_g', 'mean')]

np.float64(440.0)

If you want to remove the row MultiIndex from a groupby result, include as_index=False as a parameter to your groupby() statement:

THIS FLATTENS THE HIERARCHY PYRAMID OF VALUES INTO A FLAT TABLE

In [34]:
clothes.groupby(['color', 'type'], as_index=False).mean()

   color   type  price_usd  mass_g
0   blue  pants       40.0   200.0
1   blue  shirt       35.0   440.0
2  green  shirt       75.0   537.5
3    red  pants       47.5   305.0